Repository: atlas-studios/Session2-G9
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 葛瑞安盯着那套装备没说话，心里却早已经骂开了，靠你妈的小白脸，闲着没事拿老子寻开心呢？
en_us: Gerian stared at the set of equipment without saying a word, but in his heart, he was berating him, Damn you pretty boy, are you trying to make fun of me?

source: 葛瑞安笑咪咪的接过宝石，又凑过去看了一眼，有些好奇的问道：“这项链到底是什么好东西？”
en_us: Gerian received the gemstone cheerfully and then leaned in for another look. He asked curiously, "What exactly is this necklace?"

source: 葛瑞安脸上露出一丝苦笑，加洛斯最强魔法师间的对决，决定胜负的竟然只是一枚水晶。
en_us: A bitter smile came across Gerian's face. The winner of the battle between the most powerful mages of Jarrosus was actually decided by a crystal.

source: 葛瑞安走了之后，人也差不多到齐了。
en_us: After Gerian left, everyone had almost arrived.

source: 葛瑞安越看越是不爽，强撑着虚弱的身体，迈开步子朝老梅林走去，他决定不让公会的魔法师出手，他要亲自压扁老梅林这混蛋。
en_us: It made Gerian all the more unhappy to see it. He dragged his weak body and set forth towards Old Merlin. He would not let the mages in the guild lift a finger. He was going to crush that bastard Old Merlin all by himself.

source: 葛瑞安这一手，确实玩得高明。
en_us: Gerian had indeed executed a brilliant maneuver this time.

source: 葛瑞安这一次是真怒了，第二天天刚亮，就带着公会所有魔导士出去了。
en_us: Gerian was truly furious this time. At dawn the next day, he went out with all the Magic Shooters from the guild.

source: 葛瑞安这话，听上去虽然有些粗暴，但道理还是真的没错。
en_us: Gerian's words might sound crude but his reasoning was sound.

source: 葛瑞安那一脚比魔兽还狠，门板后的锁都被他给踹烂了，凯文扶起门板看了半天，发现根本就不可能修复，只能将门板往墙上一靠，带着一脸的苦笑说道：“还是等会长找人来修好了，我先带你去办等级认证手续。”
en_us: Gerian's kick was harsher than a beast’s attack. The lock that was behind the door was broken from his kick. Kevin lifted the door up and examined it for a long while, soon realizing that it was impossible to repair it. He could only lean the broken door against the wall, and with a bitter smile, he said, "Let's just wait for the President to call for a repairman, I'll bring you down to process the documents first."

source: 藤条被霜结术冻住之后，也同时被带走了全部的水分，风刃术虽然切不开坚韧的藤条，但用来破开冰块却是绰绰有余。
en_us: All the moisture in the rattan was taken away after being frozen by the Frost Spell. Although the Wind Blade Spell couldn't cut through the tough rattan, it was more than enough to break through ice.

source: 虽然挨了一顿痛骂，但在离开老梅林书房的时候，克伦威尔的心情却很愉快，原本只能在暗地里搞搞的小动作，却意外的得到了老梅林的首肯，这对克伦威尔来说，绝对比什么都重要，在梅林家族强大的力量支持下，弄死一个落魄的低级魔法师，简直比捏死一只蚂蚁还轻松。
en_us: Although he had been berated, Cromwell was in a good mood when he left Old Merlin's study. What could only have been done in secret was unintentionally approved by Old Merlin. To Cromwell, this was more important than anything else. With the strong support of the Merlin Family, it was easier to kill a derelict mage than to crush an ant.

source: 虽然早在落日山脉的时候，林立就在他眼前杀死了一头双足飞龙。
en_us: Lin Li had killed a Wyvern right before his eyes back when they were in the Sunset Mountains.

source: 虽然葛瑞安已经安排了凯文帮他跑腿，但很多事还是必须由他亲自去办，比如去图书馆抄录咒语。
en_us: Gerian had arranged Kevin to run his errands, but he still had to do a lot of the work by himself, for example copying spells in the library.

source: 虽然葛瑞安并不惧怕梅林家族，甚至在林立提供的药剂帮助下，还有很大的把握将他们一举消灭，可是这并不符合魔法公会的利益，两支最强势力的争斗，就算胜也只是惨胜，这只会给其他势力留下可趁之机。
en_us: Although Gerian was not afraid of the Merlin Family—more so he had the confidence that he could destroy them with the help in pharmaceutics Lin Li had provided—it was not in line with the Guild of Magic's interests. The conflict between the two most powerful forces would just end up as a tragic victory for the winner, and this would leave room for other powers.

source: 虽然这三个大活人很可能马上变成死人，但不管怎么说，至少他们现在还是活的。
en_us: Although these three living humans might soon become dead, at least they were alive at present.

source: 虽然这个机会仅仅是针对五级以下的魔法师，但梅林家族最多的，不也正是五级以下的魔法师吗？
en_us: Although this opportunity was only for mages below level-five, weren’t they what the Merlin Family had the most?

source: 虽然那只是一个迟缓术，但给安度因带来的震撼，却绝不亚于一个十八级魔法。
en_us: Although it was only the Delaying spell, it had brought shock to Andoine as it felt like a spell over level-eighteen.

source: 蛮牛之力不过是高级药剂，以林立药剂宗师的身份，稍稍闻上一闻，自然就能弄清楚失败的原因，但他能够弄清楚，却不代表别人也能弄清楚，还没等他从床上坐起，就听见一阵气急败坏的吼声从门缝间传来。
en_us: The concoction was just a high-grade potion. A pharmaceutics guru like Lin Li could easily find out the reasons for failure just by taking a whiff. But it didn't mean anyone else could. He had yet to sit up from the bed when he heard an exasperated grunt through the crack of the door.

source: 融化的深邃之银在棒身上流淌，那一道道魔纹线条，就仿佛一条条沟壑，随着最后一条沟壑被填满，先前神秘华丽的点金棒，此时却仿佛反扑归真一般，看上去浑然一体圆融无缺，只是静静的散发出蒙蒙银光。
en_us: The melted deep silver glided over the rod. The mageweaths were like ravines. As the last ravine was filled, the previously mysterious yet gorgeous gold rod seemed to recover its original simplicity. It looked an integral whole, silently emitting a misty silver light.

source: 血液是滚烫的，一般都是碱性的，一旦进入眼睛内会腐蚀眼睛内的神经，让对方暂时失明，甚至眼部受创。
en_us: Blood was boiling hot and normally alkaline in nature. Once blood entered the eyes, it would corrode the nerves within the eyes, leaving the opposing party temporarily blind and even causing damage to the eye itself.

source: 被人尊重和感激是很愉悦的事情，尤其还是个漂亮小姐。江逸在江家从未受到如此待遇，反而在外面受到了姬家小姐和这位翊小姐的高规格待遇，心情自然大好，摆手道：“小姐客气了，我一定全力以赴。”
en_us: To receive respect and gratitutde was a very delightful thing, especially since it came from a pretty young lady. Jiang Yi had never experienced such good treatment at the Jiang Clan; on the other hand, to receive such high-standard treatment outside from the young mistress of the Ji Family and this Young Mistress Yi, his emotions naturally improved greatly. He waved his hands and replied, "Young Mistress, you are too courteous. I will definitely give it my all."

source: 装饰得富丽堂皇的宴会厅之外，是一片种满奇花异草的花园，此时宴会尚未开始，还有不少宾客在花园里逗留，两人从花园中经过，自是难免引来一阵好奇的目光。
en_us: Outside the richly decorated banquet hall was a garden full of exotic flowers and plants. The banquet had not yet started and many guests still remained in the garden. As the two passed through it, they naturally drew curious looks from the other guests.

source: 西院一个破败的小院子内，江逸大口大口的扒着饭，江小奴却蹲坐旁边满脸傻笑，手里拿着一片亮晶晶的紫色金叶子，感觉一切都是那么的不真实。
en_us: In a small poorly-maintained courtyard of the Western Court, Jiang Yi swallowed down big gulps of rice as Jiang Xiaonu squatted beside him, her face grinning foolishly. As she held the bright, sparkling piece of purple gold leaf, she felt as though all of it was quite surreal.

source: 要想伤势尽快复原，关键在于外药内调。
en_us: The most important factor behind the speedy recovery of any wound was to apply medicine on the exterior and “regulate” from the interior.

source: 要打，他身上没有黑色元力了，不说没受伤的护卫还有两人，这管事明显实力也不低。打下去结局只有一个，他爬着回江家……
en_us: If he chose to fight, there was no more black essence force in his body. To say nothing of the two uninjured guardsmen still available, the housekeeper himself evidently had power at a level that was not considered weak. There would only be one outcome should they fight: that of Jiang Yi crawling back to the Jiang Residence...

source: 要是知道事情会发展到这个地步，就该再早一点出手的，刚刚可是一连拍了九瓶出去，只要把那九瓶奥法药剂弄到，又哪会被逼到跟萨鲁曼家族刺刀见红的地步？全加洛斯城都知道，鲁本－萨鲁曼是个疯子，疯子是不会跟你讲道理的，看吧看吧，这贱人上来就爆出五十万的天价，这他妈还给不给人留条路走了？
en_us: If he’d known that things were going to get this far, he would have made his move sooner. Nine bottles were sold off consecutively earlier on, and if he had gotten them, he wouldn't have been forced to fight at such a close-range with the Saruman Family. Reuben Saruman was a lunatic, and a lunatic would not reason with you. Just look, this bastard had offered the princely sum of 500,000 at the beginning. Was he going to leave a damn way for others?

source: 要是自己猜得没错的话，眼前这个穿得有些落魄的年轻魔法师，竟是最近一段时间来，加洛斯城内最富传奇色彩的人物——魔法公会复兴的希望，还不满二十岁的药剂大师，一手促成了百万金币拍卖会，那个引发加洛斯最强魔导士之战后，就一直被传闻包围着，却极少在人前露面的魔法师费雷！
en_us: If their guesses were correct, the abject-looking young mage in front of them was currently the most legendary figure in Jarrosus City—the hope for revival of the Guild of Magic, the potion master below the age of 20, the one who had single-handedly facilitated the million gold coins auction, and the one who, after having triggered the battle between the most powerful mages, was wrapped up in rumors but rarely appeared in public—Mage Felic!

source: 要知道魔法师是一个等级森严的职业，每一个等级都意味着力量上的飞跃性进展，大魔导士与魔法师之间的鸿沟，比幽暗之海更加遥远，只有在同等级战斗中，比如老梅林与葛瑞安这个层面的战斗，比拼的才是规则。
en_us: Mage was a highly hierarchical profession, and each level implied a great progress in power. The gap between an archmage and a mage was vaster than the sea of darkness. It was only in levelled battles, such as those between Old Merlin and Gerian, that competition was the rule.

source: 要让梅林家族度过将来的危机，就必须先除掉这个可怕的年轻魔法师。
en_us: In order to let the Merlin Family cruise through future crises, they had to first get rid of this terrifying young mage.

source: 要闹，那更不可能，江家离开这并不远，一旦传回江家此事后果更加严重，那剩下唯有按对方的要求办了。
en_us: If he chose to complain further... that option was even more improbable. The Jiang Residence was not far from here. Should this incident get spread to the Jiang Clan, the consequences would be even more severe. That left only one solution, which was to give in to his opponent's requests.

source: 见林立一脸陶醉，红发美女心中的屈辱更甚，暗自骂了一声“小人得志”之后，却又很快被林立的话吸引住了。
en_us: Seeing how Lin Li was revelling in self-satisfaction, the redheaded beauty felt even more humiliated. After cursing silently "scoundrel got his way", she was quickly attracted by Lin Li's words.

source: 见林立还要罗嗦，两人顿时就火了，捏起拳头就要动手。
en_us: Seeing that Lin Li had wanted to continue his ramble, the two men became enraged and held their fists up.

source: 见葛瑞安还有力气吹牛，在大厅里等了半晚上的两人，终于是稍稍放心些了。
en_us: Seeing how Gerian still had the energy for big talk, the two of them who had been waiting in the hall for half the night were relieved at last.

source: 警报一连响了三遍，林立刚要抽身下线，却忽然发现自己的人物已经不受控制。
en_us: The siren sounded thrice. Lin Li was about to go offline when he realized he had lost control of his character.

source: 让他庆幸万分的是，这时不远处的那名管事突然大喊一句，喝止了这护卫。
en_us: Fortunately for him, at that moment that housekeeper suddenly shouted loudly from a not-too-faraway distance, ordering the guard to stop.

source: 让他很郁闷的是，他的黑色元力太少了，仅仅片刻时间后，修炼出来的六缕黑色元力就全部消耗完了。
en_us: What made him dismal was that his black essence force was too little—in only a matter of seconds, the six strands of refined black essence force had been completely consumed.

source: 让他微微心安的是，他跟着这护卫进来后，看到的是一个空旷的大殿，里面一个人也没有，他将斗篷拉低了一些，暗暗祈祷不要遇到江恨水。
en_us: What made his heart relax was that after he had followed that guard in, all he saw was a spacious and empty central hall, with not a single person inside. He allowed himself to lower his cloak slightly, while silently praying that he would not meet Jiang Henshui here.

source: 让他百思不得其解的是，当他运转融合元力开始在伤口附近流转辅助伤口愈合时，却发现疗伤速度和原先蓝色元力一模一样，根本不能增幅。
en_us: What left him perplexed was that, when he circulated the combined essence force near his wounds to facilitate healing, he found out that the healing speed was exactly the same as that of the original blue essence force. The speed would not increase no matter what.

source: 让刘管事傻眼的是，江逸竟突然失踪了，他买通江家下人去探查江逸的情况，却被告知外出三月……
en_us: However, Jiang Yi's sudden disappearance completely derailed Housekeeper Liu, who tried to bribe the servants of the Jiang Clan in an attempt to figure out his whereabouts, but all the information he obtained was that Jiang Yi would be gone for three months...

source: 让她错愕的是，只有铸鼎境二重的江逸竟依旧轻松能躲避开去，这次她还是没有碰触到江逸的半片衣角。
en_us: What left her astonished was that Jiang Yi, whose power level was only at the second stage of the Cast Tripod Realm, could actually once again easily avoid her attack. This time she once again failed to touch even the corner of Jiang Yi's robes.

source: 让林立大跌眼镜的是，一向老实的凯文，今天竟然脱下了法师袍，穿上了一件长袖高领的白色衬衣，外面还套着一件黑色马甲，手拿一把小小的木锤站在台上，竟是冒充起临时拍卖师来！
en_us: What made Lin Li's jaw drop was that Kevin, who had always been genteel, had taken off his mage robe and put on a white, high-collared long-sleeved blouse today. He wore a black waistcoat and stood on the stage holding a small hammer in his hands, temporarily posing as an auctioneer!

source: 让江逸惊愕的是，他元力刚刚注入丹炉内，那丹炉竟如一块吸水的海绵般，快速的自动吸收他的元力，而且吸收的速度快得吓人，他双手经脉内的元力一下就全被吸收完了。
en_us: What befuddled Jiang Yi was that the essence force, which he had just been applied to the cauldron, was being absorbed speedily and automatically by the cauldron like a sponge—with the absorption at a shocking speed, so fast that the essence force in the meridians in his hands was completely absorbed in an instant.

source: 让江逸诧异的是，那身材火辣的翊小姐进来后没有立即出手，反而朝他感激的一笑，抱拳行礼道：“你叫苍狼？多谢你的陪练！希望你今日同样全力以赴。”
en_us: What astonished Jiang Yi was that, Young Mistress Yi, who had a hot figure, did not immediately launch an attack upon entry, but rather smiled at him with a look of gratitude. She cupped her fists and bowed, saying, "Is your name 'Lone Wolf'? Thank you very much for your combat practice with me the other time! I hope that, like before, you will give it your all today."

source: 讪讪的走出聚珍阁，江逸茫然的站在广场上，看着车水马龙川流不息，内心苦恼不已。有了灵神丹，他倒是不惧江如虎等人了，问题是炼丹房都被封了，他也没废丹，怎么快速赚钱啊？
en_us: Embarrassed, Jiang Yi walked out of the Pearl Gathering Pavilion and blankly stood at the City Plaza. As he observed the unending flow of heavy traffic, his heart felt endlessly distressed. With the Spirit Pills, he was actually not fearful of Jiang Ruhu and his cronies. The problem was in that situation that with the sealing-up of the alchemy lab, and without any more useless elixirs, how could he rapidly make lots of money?

source: 记得当初林立刚来魔法公会的时候，葛瑞安为了给他开放公会最高特权，还在公会内部引起了一片反对的声音，其中反对得最激烈的是几个魔导士，为了威胁葛瑞安，甚至还不惜以退出公会相逼。
en_us: When Lin Li had first arrived at the Guild of Magic, Gerian had caused a lot of opposition within the guild in order to open up the highest privileges for him. Among them, the most vehement opposition came from several Magic Shooters, who even threatened to withdraw from the guild in order to pressure Gerian.

source: 论家世自己出身于法兰王国最显赫的魔法家族，自己的父亲甚至在魔法师公会都算是能说上话的人物，论财富更不用说，黑暗年代之后上千年的积累，自己家族早已是富可敌国，叔叔法里奥更是一直担任着王国财富大臣一职。
en_us: He was born into the most prominent mage family in the Felan Kingdom, and his father was someone who had a say in the Guild of Magic. His family was strikingly rich with the accumulation of over thousand years of wealth after the Dark Ages, and his uncle Fario had held the position of the Minister of Wealth in the kingdom all along.

source: 话一出口，江逸就有些后悔了，他忘记了一件事，江恨水好像就在武殿里面？万一和江恨水对上了，他身份不得立即曝光？江家子弟在武殿内当陪练，这可不是光彩的事情……
en_us: As the words left his mouth, Jiang Yi instantly felt some regret. He forgot one thing: wasn't Jiang Henshui in the Martial Arts Hall? If he was paired up with Jiang Henshui, wouldn't his identity immediately be revealed? That a descendant of the Jiang Clan was serving as a sparring partner in the Martial Arts Hall... this was not something honorable at all...

source: 话说到这种程度，马森自然也不好再继续追问，只是望向林立的目光中，却已是充满了不可思议的神色，他无论如何也没有想到，这个自称七级魔法师的室友，怎么会有如此恐怖的来历……
en_us: At this point, Marson knew, of course, that it would be improper to question further. But when he looked at Lin Li, his gaze was already filled with incredibility. Never had he expected that his roommate, who claimed to be a level-seven mage himself, could possibly have such a terrifying background.

source: 话还没落下，江逸的腿又高高抬起，对着江如虎的一条腿狠狠踩下……
en_us: Before he even finished his sentence, Jiang Yi lifted his leg high and stomped on Jiang Ruhu's leg.

source: 说到最后，红发美女声音中已是带着一丝冷咧，那不经意间散发出来的气势，就连林立也不由暗暗心惊，这至少是十级以上强者的气息。此时的红发美女，就仿佛是一把美伦美焕的利剑，如秋水般流转的眼波中，充满了锋芒毕露的杀意。
en_us: By the end, the redheaded beauty's voice was bitterly cold. The imposing manner that was displayed by her inadvertently frightened Lin Li. It was an aura of at least a level-ten player. At this moment, the redheaded beauty was like a magnificent sword, full of murderous intent in her eyes that flowed like the autumn waters.

source: 说到这个翊凌雪满脸兴奋起来，攥着小拳头笑着说道：“苍狼，不瞒你说这些其实是你的功劳，我天资怎么样我自己清楚，感悟武技速度很慢，要不是你……我这十多种武技怎么会那么快达到大成？今日我留下来其实是就是为了这事！”
en_us: Yi Lingxue grew excited at Jiang Yi's words and fisted her hands, smiling, "To be honest with you, Lone Wolf, all these achievements were because of you. I'm perfectly aware of the extent of my own abilities. Actually, the reason I'm staying behind today is precisely this!"

source: 说到这里的时候，葛瑞安一张胖脸已经完全苦下来了：“这下麻烦大了，万一城主大人也对那三十瓶奥法药剂感兴趣，其他人谁还敢跟他竞争？”
en_us: At this point, Gerian's chubby face was completely sullen. "We're in big trouble. If the Castellan is interested in those 30 bottles of Arcane Magic Potions, who else would dare to compete with him?"

source: 说到这里的时候，葛瑞安稍稍顿了一顿，这才又继续说道：“他回来之后，干的第一件事就是杀人，从他同父异母的弟弟，到他自己的亲生父亲，凡是有资格占据族长位置的人，一夜之间都被他杀了个精光，之后鲁本又用铁血手段，将整个家族牢牢控制在手里，之后的三十年中，他更是将当初那个小小的萨鲁曼家族，一手带到了如今加洛斯三大家族之一的位置！”
en_us: At this point, Gerian paused slightly before he continued, "After he returned, the first thing he did was to kill. From his half-brother to his father, those who were qualified for the position of the patriarch were killed off by him in a night. After that, Reuben had the whole family tightly controlled in his hands with his iron fists. In the subsequent 30 years, he had even brought the then-small Saruman Family to one of the three biggest families in Jarrosus today!"

source: 说到这里，老梅林眼中透出一丝杀意：“而且你想过没有，如果让这些奥法药剂落到了别的家族手里，梅林家将会有什么下场？”
en_us: Old Merlin had a murderous glint in his eyes at the mention of this. "Also, has it ever crossed your mind, if these Arcane Magic Potions fall into the hands of other families, what will become of our Merlin Family?"

source: 说到魔法……
en_us: Speaking of magic...

source: 说完也不管林立有什么反应，一伸手推开虚掩的房门，又埋头在烧杯与试管间忙碌起来。
en_us: Not waiting for any reaction from Lin Li after he finished his sentence, he stretched out his hand and pushed the unlatched door open, once again burying himself among his beakers and test tubes.

source: 说完也不跟老头罗嗦，从怀里掏出伊娜送给自己的卷轴袋来。
en_us: He had cut the chase with the old geezer after finishing his words and pulled out the scroll pouch Ina had given him from his pockets.

source: 说完又四下张望了一番，确定没人偷听之后，这才盯着凯文威胁道：“除了魔法等级之外，其他记录全部销毁，另外，今天的事不准透露出去，谁问你都不能说，连你爸爸也不例外，要是走漏了风声，你看老子怎么收拾你！”
en_us: Then, he took a look around and made sure no one was eavesdropping on them. With a menacing stare directed at Kevin, he threatened, "Destroy all other evidence except the magic level. Also, do not reveal the things that have happened today no matter who asks about it—and that includes your father. If news is leaked, let's see how I'll deal with you!"

source: 说完林立又有些疑惑的望着灰袍法师：“我就是费雷，您是……”
en_us: Then, Lin Li looked at the mage in gray robe doubtfully. "I am Felic, you are..."

source: 说完柳长老就钻进了偏厅，江逸却傻眼了，他哪懂什么茯苓？什么是白矾啊？他又不敢多问，只能讪讪的走进了存放药草的房间内。
en_us: After instructing Jiang Yi, Elder Liu immediately went into the side room. Yet Jiang Yi stood dumbstruck. How could he possibly know what china root was? And what on earth was alum? However, he did not dare to ask further. He had no choice but to walk into the room where the ingredients were stored.

source: 说完江逸再次抬腿狠狠对着江如虎剩下的一条好腿踩下，又单腿猛然将他的身子重重的踹飞出去，目光才在众人身上扫过，沉喝道：“半个时辰之内，给江如虎治疗，否则他……必死无疑！你们所有人给小爷我记住，以后看到我必须绕道，谁敢再挑衅小爷，江如虎就是你们榜样。”
en_us: Finishing what he had to say, Jiang Yi raised his leg once again before viciously stepping down on Jiang Yi's remaining good leg. Suddenly, with one of his legs, he sent Jiang Ruhu's body heavily flying off with another kick. It was only then that he swept a gaze across the bodies of all his remaining opponents before deeply shouting, "Heal Jiang Ruhu within the next hour, otherwise he... would definitely die, no doubt about that! All of you better remember, if you ever see me, your Young Master, in the future, you must make a detour around me. Otherwise, should you dare to provoke me, your Young Master, the fate of Jiang Ruhu today would be happening to you."

source: 说完江逸就不顾这杨管事的挽留，径直朝武殿外走去，在门口那黑甲护卫诧异的目光中，朝城东的江家大院快步走去。
en_us: Finishing what he had to say and ignoring Manager Yang's attempt at making him stay, Jiang Yi directly walked out of the Martial Arts Hall. In the incredulous gaze of the guard wearing black armour, he walked in a quick pace towards the Jiang Residence Central Courtyard in the east of the city.

source: 说完江逸收起紫金，很没礼貌的一拱手匆忙朝外面走去。那鹤大师本还想多问几句，却被姬听雨一抬手拦住了下来。
en_us: Finishing what he had to say, Jiang Yi kept the purple gold, before impolitely cupping his hands to bid them farewell and hurriedly walked out of the Pavilion building. Master He initially wanted to asked more questions to him, but he was prevented from doing so with a raise of Ji Tingyu's hand.

source: 说完江逸身子就朝西山之下爆射而去，所有江家子弟摄于江逸的威势，竟无人敢拦截，反而很多人看着江逸的背影都露出畏惧之色。
en_us: Finishing his statemnet, Jiang Yi rushed off in a burst of quick speed, in the direction of the foot of the Western Hills. Having taken in the supreme might of Jiang Yi's power, out of all the Jiang Clan descendants surrounding him, none of them actually dared to stop him in his tracks. Conversely, many of them looked at the figure of Jiang Yi's back as he raced away, revealing a look of pure horror on their faces.

source: 说完管事放下丹药走了出去，没过一会带着一名白发苍苍的老者走了进来，这老者穿着一身月白色的长袍，满脸的不耐烦神色。
en_us: Finishing what he had to say, the housekeeper put down the elixir and walked out of the booth. It was not long before he brought a white-haired old man into the booth. The elderly man was dressed in a moon-white long robe, with his face giving off a sense of much impatience.

source: 说完荣管事便长袖一拂，大步离去。江逸只能讪讪的摸了摸鼻子，回房洗漱了一番，几口喝掉锅里的肉粥，就急急朝西山走去。
en_us: Upon finishing, Chief Rong flicked his long sleeves disdainfully and strode away from the courtyard. All Jiang Yi could do was scratch his nose in embarrassment. He headed back home to quickly freshen up and gulp down in a couple of mouthfuls of the meat porridge in the pot, before hastily making his way to the Western Hills.

source: 说完这句话之后，城主大人的眉头又皱了一皱，低声向黑袍法师说道：“安德鲁，你最近如果没什么事的话，也不妨多关注一下魔法公会，我对格林先生要找那人，其实也很有点兴趣。”
en_us: After finishing the previous sentence, the castellan's brows were knitted again. He spoke to the mage in black robe in a low voice, "Andrew, if you have nothing much to do lately, you might want to pay more attention to the Guild of Magic. I'm actually also interested in the man Mr Grimm is looking for."

source: 说完，江恨水径直走进丹房取了几大瓶丹药就离开了炼丹房，走出丹房后再也没有看江逸一眼，更别说道别了，宛如两个陌路人。
en_us: Finishing his sentence, Jiang Yi walked directly into the elixir room, retrieved several big bottles of elixirs and left the alchemy lab. As he left the alchemy lab, he did not look back and give Jiang Yi a glance, to say nothing of sending him a farewell. It was as though they were two strangers to each other.

source: 说完，江逸目光陡然扫向江豹，身子也闪电般朝江豹冲去，身上杀气十足，双腿和衣袍之上都有江松的鲜血，看起来如一尊杀神般恐怖。
en_us: Finishing his declaration, Jiang Yi's sights suddenly turned to look at Jiang Bao; like a lightning, he rushed at Jiang Bao. He looked just like a horrifying killer god that was bursting with killing intent, both his legs and robes were drenched with Jiang Song's blood.

source: 说干就干。
en_us: If Jiang Yi said he'd do it, he would definitely do it!

source: 说干就干！
en_us: That was how Jiang Yi was: if he said he would do it, he would definitely do it!

source: 说时迟，那时快！
en_us: In the blink of an eye!

source: 说来也是有些巧合，两父女刚到任务公告处，就有一批新的任务公告出来。
en_us: It was also coincidence that as soon as the father and daughter arrived at the quest notice board, a new batch of quests had just been announced.

source: 说着林立将麦格雷尼的右手抬起：“看看这是什么。”
en_us: As Lin Li spoke he lifted McGrenn's right hand. "Look at what this is."

source: 说着林立找了个僻静的角落，悄悄打开无尽风暴之戒，从里面掏出了半截狮蝎尾刺，这是他当初帮安度因采野钢花的时候，从那头狮蝎尸体上切下来的，当初林立只是觉得这东西毒性不错，以后万一想弄点什么武器的话，应该能用得着，不过麦格雷尼父女怎么也算是给自己当了回向导，如今又正是需要的时候，林立也就不好意思再继续藏着了。
en_us: He found a quiet corner and silently opened up the Ring of Endless Storm. From inside the ring he took out half of the Manticore's hook which he had nicked off from the dead Manticore he’d encountered when he was out picking wild steelbloom for Andoine.

source: 说着枯瘦的手指从脖子下划过，比了一个干掉的手势。
en_us: As he spoke, his gaunt fingers ran across the neck, indicating he was to “eliminate” the issue.
